In [2]:
import numpy as np
import pandas as pd

In [18]:
s = pd.Series([2,-1,3,5], index = ['s03242021_01','s03242021_02','s03242021_03','s03242021_04'])

In [19]:
np.square(s)

s03242021_01     4
s03242021_02     1
s03242021_03     9
s03242021_04    25
dtype: int64

In [20]:
s + [1000]

s03242021_01    1002
s03242021_02     999
s03242021_03    1003
s03242021_04    1005
dtype: int64

In [21]:
x = pd.DataFrame()

In [22]:
x['numbers'] = s

In [23]:
x['square'] = np.square(s)

In [24]:
x['cube'] = np.power(s,3)

In [46]:
y = [9,81,729]
y

[9, 81, 729]

In [47]:
x.loc['new student'] = y

In [48]:
x

              numbers  square  cube
s03242021_01        2       4     8
s03242021_02       -1       1    -1
s03242021_03        3       9    27
s03242021_04        5      25   125
new student         9      81   729

In [50]:
l = list(x.columns)

In [52]:
l.sort()
l

['cube', 'numbers', 'square']

In [59]:
x = x[l]
x

              cube  numbers  square
s03242021_01     8        2       4
s03242021_02    -1       -1       1
s03242021_03    27        3       9
s03242021_04   125        5      25
new student    729        9      81